# Jupyter Notebook: Data cleaning

## Step 1: Install Required Libraries

First, ensure you have the necessary libraries installed. You can install them using the following command:

`pip install pandas numpy seaborn matplotlib`

## Step 2: Import Required Libraries

In [23]:
import pandas as pd
import numpy as np
import os

## Step 3: Load the titanic dataset
Update the variable file_path to the path where you have your data.

In [24]:
df = pd.read_csv(os.path.join('titanic.csv'))

# Visualizing the first few rows of the dataset
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Step 4: Understanding the Data
Check dataset information, including data types and non-null counts
This helps us identify missing values and understand the data format

In [25]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  892 non-null    int64
 1   Survived     892 non-null    int64
 2   Pclass       892 non-null    int64
 3   Name         892 non-null    str
 4   Sex          892 non-null    str
 5   Age          715 non-null    float64
 6   SibSp        892 non-null    int64
 7   Parch        892 non-null    int64
 8   Ticket       892 non-null    str
 9   Fare         892 non-null    float64
 10  Cabin        204 non-null    str
 11  Embarked     890 non-null    str
dtypes: float64(2), int64(5), str(5)
memory usage: 83.8 KB

Check for missing values in each column to plan how to handle them

In [26]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          688
Embarked         2
dtype: int64

## Step 5: Removing missing values
For numerical columns (e.g., Age) we can fill missing values with the median.

In [27]:
# Fill missing 'Age' values with the median
df['Age'] = df['Age'].fillna(df['Age'].median())

# Step 6: Remove irrelevant data
This dataset is used to predict if a passenger would survive the Titanic based on the information that we have about that passenger. However, some of the columns of the dataset contain information which is irrelevant to predict a passenger's chance of surviving. For example the passengner ID.

In [28]:
df.drop(['PassengerId'], axis=1, inplace=True)

df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Step 7: Convert categorical values to numerical
Some of the columns of the dataset contain categorical information like Sex and Embarked. However, machine learning algorithms require numerical input. We are going to transform the categorical values from the Sex column (female and male) to numerical by assigning a 0 to male and 1 to female.

In [29]:
# convert sex to numerical
df['Sex'] = df['Sex'].replace({'male': 0, 'female': 1})

df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S

### Exercise 1

Determine what percentage of the cabin data is missing. Explain and justify what you think it should be done to handle those missing values. Then, write the corresponding code. 

<div style="text-align: right;">
  (1 mark)
</div>

<span style="color:red">Your answer goes here</span>

In [30]:
# As 77% of the 'Cabin' values are missing, we can drop this column (The corresponding code has been done in exercise 2)
df.isnull().sum()['Cabin']/len(df)*100

np.float64(77.13004484304933)

### Exercise 2

Idenfity and justify which columns are irrelevant to determine if a passenger will survive the Titanic. Then, write the corresponding code. 

<div style="text-align: right;">
  (1 mark)
</div>

<span style="color:red">Your answer goes here</span>

In [ ]:
# Name is redundant as it is unique for each passenger and irrelavant to survival, and Ticket is also redundant as it is unique for each passenger, so we can drop these columns
df.drop(['Name'], axis=1, inplace=True)
df.drop(['Ticket'], axis=1, inplace=True)
# Cabin has 77% missing values, so we can drop this column
df.drop(['Cabin'], axis=1, inplace=True)
df.head()

   Survived  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0         0       3   0  22.0      1      0   7.2500        S
1         1       1   1  38.0      1      0  71.2833        C
2         1       3   1  26.0      0      0   7.9250        S
3         1       1   1  35.0      1      0  53.1000        S
4         0       3   0  35.0      0      0   8.0500        S

### Exercise 3

Transform the Embarked column from categorical to numerical.

<div style="text-align: right;">
  (1 mark)
</div>

In [32]:
df["Embarked"] = df["Embarked"].replace({"S": 0, "C": 1, "Q": 2})
df["Embarked"] = df["Embarked"].replace({"s": 0, "c": 1, "q": 2})
df["Embarked"].unique()

array([0, 1, 2, nan], dtype=object)

### Exercise 4

Identify what type of data is the Embarked column. Explain why you can't fill in the missing values with the mean. Propose and justify an alternative and provide the corresponding code. 

<div style="text-align: right;">
  (2 marks)
</div>

<span style="color:red">Your answer goes here</span>

In [ ]:
# Your answer goes here
# It is categorical data, now turned into discrete numerical, so cannot be mathematically averaged. We can either drop the column or fill the missing values with the most common value (mode).

most_common_embarked = df["Embarked"].mode()[0]
df["Embarked"] = df["Embarked"].fillna(most_common_embarked)

### Exercise 5

Transform the Embarked column from categorical to numerical.

<div style="text-align: right;">
  (1 mark)
</div>

In [34]:
# This exercise has been repeated
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

### Exercise 6

Examine the Age column to identify any values that are impossible or unrealistic (e.g., negative ages or extreme values). Handle them appropriately.

<div style="text-align: right;">
  (2 marks)
</div>

In [35]:
#Loop through all ages in dataset
df['Age'] = np.where(df['Age'] < 1, df["Age"].median(), df['Age'])
df['Age'] = np.where(df['Age'] > 80, df["Age"].median(), df['Age'])
df["Age"].unique()

array([22. , 38. , 26. , 35. , 28. , 54. ,  2. , 27. , 14. ,  4. , 58. ,
       20. , 39. , 55. , 31. , 34. , 15. ,  8. , 19. , 40. , 66. , 42. ,
       21. , 18. ,  3. ,  7. , 49. , 29. , 65. , 28.5,  5. , 11. , 45. ,
       17. , 32. , 16. , 25. , 30. , 33. , 23. , 24. , 46. , 59. , 71. ,
       37. , 47. , 14.5, 70.5, 32.5, 12. ,  9. , 36.5, 51. , 55.5, 40.5,
       44. ,  1. , 61. , 56. , 50. , 36. , 45.5, 20.5, 62. , 41. , 52. ,
       63. , 23.5, 43. , 60. , 10. , 64. , 13. , 48. , 53. , 57. , 80. ,
       70. , 24.5,  6. , 30.5, 34.5, 74. ])

### Exercise 7

Calculate the percentage of passengers who survived the Titanic disaster.
(Hint: search for the `value_counts` function in the Pandas documentation)

<div style="text-align: right;">
  (1 mark)
</div>

In [36]:
# Your answer goes here
df["Survived"].value_counts()[1]/len(df)*100

np.float64(38.34080717488789)

### Exercise 8

Check whether the dataset contains any duplicate rows. If duplicates are found, handle them appropriately.

<div style="text-align: right;">
  (1 mark)
</div>

In [37]:
# Your answer goes here
print(len(df))
df.drop_duplicates(inplace=True)
print(len(df))

892
775

### Exercise 9

Previously, we filled missing age values using the average age. Propose two alternative methods for handling these missing values. For each method, explain how it might influence the results of future statistical analyses.

<div style="text-align: right;">
  (2 marks)
</div>

<span style="color:red">Your answer goes here</span>
1. Remove columns with missing age completely. May reduce amount of data but increases accuracy of data.
2. Do not fill it with the average age, ages below 1 should be replaced with 1 and ages above 80 can be filled with 80. This way, in case the data is accurate (e.g. children acctually aged below 1), we can preserve it. This method also preserves more data by not needing to delete any rows, allowing for more data for future statistical analyses.

### Exercise 10

Examine the Embarked column to determine whether the data is consistently formatted (for example, consistent use of uppercase and lowercase letters). If inconsistencies exist, clean the column to ensure uniform formatting.

<div style="text-align: right;">
  (2 marks)
</div>

In [38]:
# Your answer goes here
df["Embarked"] = df["Embarked"].replace({"s": 0, "c": 1, "q": 2})

### Exercise 11

Save the cleaned dataset in a new csv file. Be careful not to overwrite the original file.

<div style="text-align: right;">
  (1 mark)
</div>

In [39]:
# Your answer goes here
df.to_csv('titanic_cleaned.csv', index=False)

## Extension 1

Create a new column called FamilySize by combining SibSp (siblings/spouses) and Parch (parents/children).

In [42]:
df["Familysize"] = df["SibSp"] + df["Parch"] + 1
df.drop(['SibSp'], axis=1, inplace=True)
df.drop(['Parch'], axis=1, inplace=True)
df.head()

   Survived  Pclass Sex   Age     Fare Embarked  Familysize
0         0       3   0  22.0   7.2500        0           2
1         1       1   1  38.0  71.2833        1           2
2         1       3   1  26.0   7.9250        0           1
3         1       1   1  35.0  53.1000        0           2
4         0       3   0  35.0   8.0500        0           1

### Extension 2

Extract passenger titles from the Name column (e.g., Mr., Mrs., Miss.). Investigate whether there are any inconsistencies between a passengerâ€™s title and their recorded gender or age, and describe any issues you find.